{
  "Portfolio": "نمونه کارها",
  "Maryam Alipour": "مریم علیپور",
  "services": "خدمات",
  "About": "درباره",
  "Skills": "مهارت‌ها",
  "Projects": "پروژه‌ها",
  "I am": "من",
  "Front End Developer": "توسعه‌دهنده فرانت‌اند",
  "Skills & Experience": "مهارت‌ها و تجربه‌ها",
  "My Skills": "مهارت‌های من",
  "Experience": " تجربه ها",
  "Education": "تحصیلات",
  "Insurance employee": "کارمند بیمه",
  "Iran Insurance Office": "دفتر بیمه ایران",
  "WordPress website": "وب‌سایت وردپرس",
  "Personal Business": "کسب‌وکار شخصی",
  "Software Engineering, North University": "مهندسی نرم افزار دانشگاه شمال",
  "Freecodecamp Front End Development": "توسعه فرانت‌اند Freecodecamp",
  "Sabzlearn JavaScript": "javascript سبزلرن",
  "Sabzlearn ReactJS": "reactjs سبزلرن",
  "My Projects": "پروژه‌های من",
  "Let's Work Together": "ارتباط با من",
  "Call me:": "با من تماس بگیرید:",
  "Mail me:": "برای من ایمیل بفرستید:",
  "Follow me:": "مرا دنبال کنید:",
  "Training Manager":"مدیر آموزش",
  "Ishraq School of Zanjan":"آموزشگاه اشراق زنجان",
  "Personal business":"کسب‌وکار شخصی",
  "2022 2024":"1401 1403",
  "2020 2022":"1399 1401",
  "2018 2020":"1397 1399",
  "2007 2010":"1386 1389",
  "Download CV": "دانلود رزومه",
  "About Me": "درباره من",
  "Software engineer": "مهندس کامپیوتر",
  "My Servises": "خدمات من",
  "Hire Me": "استخدام من",
  "WordPress Site Installation and Setup with Ready-Made Templates": "نصب و راه‌اندازی سایت وردپرسی با قالب‌های آماده",
  "Starting at 4,000,000 Toman": "شروع قیمت از ۴,۰۰۰,۰۰۰ تومان",
  "Install WordPress and deploy a ready-made template on the client’s hosting, register a domain, perform the initial site setup, and provide free consultation to help choose the best template and hosting": "نصب وردپرس و راه‌اندازی قالب آماده روی هاست مشتری، ثبت دامنه، انجام تنظیمات اولیه سایت و ارائه مشاوره رایگان برای انتخاب بهترین قالب و هاست",
  "Professional WordPress Website Design":"طراحی حرفه‌ای سایت با وردپرس",
  "Starting at 7,000,000 Toman": "شروع قیمت از ۷,۰۰۰,۰۰۰ تومان",
  "Design and launch a custom WordPress website, including domain registration, payment gateway integration, banner and image design, creation of five main pages based on client needs, adding custom images, SMS panel setup, obtaining e-trust certification, and free consultation throughout the design process": "طراحی و راه‌اندازی سایت اختصاصی وردپرس شامل ثبت دامنه، اتصال درگاه پرداخت، طراحی بنر و تصاویر، ایجاد پنج صفحه اصلی بر اساس نیاز مشتری، افزودن تصاویر اختصاصی، راه‌اندازی پنل پیامکی، دریافت نماد اعتماد الکترونیکی و مشاوره رایگان در طول فرایند طراحی",
  "UI Implementation and Coding":"پیاده‌سازی و کدنویسی رابط کاربری",
  "Starting at 10,000,000 Toman":"شروع قیمت از ۱۰,۰۰۰,۰۰۰ تومان",
  "Implement and code website user interfaces using CSS, Tailwind CSS, and Bootstrap, ensuring fully responsive and professional layouts tailored to the client’s design and requirements": "پیاده‌سازی و کدنویسی رابط کاربری سایت با استفاده از CSS، تیلویند CSS و بوت‌استرپ، با طراحی کاملاً واکنش‌گرا و حرفه‌ای مطابق نیاز و طراحی مشتری",
  "Front-End Development with ReactJS and Next.js": "توسعه فرانت‌اند با ReactJS و Next.js",
  "Starting at 20,000,000 Toman":"شروع قیمت از ۲۰,۰۰۰,۰۰۰ تومان",
  "Develop all types of front-end projects using ReactJS, Next.js, and JavaScript, with teamwork capability, experience in working with various databases, and integrating with different APIs": "توسعه انواع پروژه‌های فرانت‌اند با استفاده از ReactJS، Next.js و جاوااسکریپت، همراه با قابلیت کار تیمی، تجربه کار با پایگاه‌های داده مختلف و اتصال به انواع APIها",
  "In this project, through effective teamwork and using tools such as Tailwind CSS, JavaScript, Figma, Trello, Google Meet, and GitHub, I fully implemented the user interface designed for Karjoo+ Human Resources Studio. The result of this collaboration is a professional and responsive landing page that introduces Karjoo+ services and products and plays an important role in attracting employers and job seekers.": "در این پروژه، با همکاری تیمی و با استفاده از ابزارهایی مانند تیلویند سی‌اس‌اس، جاوااسکریپت، فیگما، ترلو، گوگل میت و گیت‌هاب، رابط کاربری طراحی‌شده برای استودیو منابع انسانی کارجوپلاس را به طور کامل پیاده‌سازی کردم. نتیجه این همکاری، یک لندینگ حرفه‌ای و واکنش‌گرا برای معرفی خدمات و محصولات کارجوپلاس شد که نقش مهمی در جذب کارفرمایان و کارجویان دارد",

  "My name is Maryam Alipour, a software engineer specializing in front-end development with a passion for learning computer sciences. Currently, I am available for remote work or project-based opportunities, and I can be present in Tehran for essential tasks or project deliveries. Alongside my technical expertise, I prioritize developing business skills, self-awareness, and understanding personality types to continually grow both professionally and personally.":" مریم علیپور هستم، مهندس نرم‌افزار و برنامه‌نویس فرانت‌اند که به یادگیری علوم کامپیوتر علاقه‌مندم. در حال حاضر آماده همکاری به صورت دورکاری یا پروژه‌ای هستم و برای تحویل کار یا موارد ضروری امکان حضور در تهران را دارم. در کنار مهارت‌های تخصصی، یادگیری مهارت‌های تجاری، خودآگاهی و شناخت تیپ‌های شخصیتی از اولویت‌های من بوده و تمام تلاشم را برای پیشرفت در این زمینه‌ها می‌کنم",
  "My name is Maryam Alipour, a software engineer with five years of experience designing websites. I specialize in front-end development and am proficient in tools and frameworks such as WordPress, React, and Next.js. I am available for remote or project-based work and excel in building responsive and user-friendly websites. Additionally, I enjoy collaborating with teams, and I am open to opportunities requiring teamwork or individual contributions. I am committed to continuous learning and personal growth, focusing on both technical and business skills to enhance my professional journey":"مریم علیپور هستم، مهندس نرم‌افزار با پنج سال سابقه طراحی وبسایت. در زمینه توسعه فرانت‌اند تخصص دارم و با ابزارها و فریم‌ورک‌هایی مثل وردپرس، ری‌اکت و نکست‌جی‌اس توانایی طراحی و پیاده‌سازی سایت‌های حرفه‌ای را دارم. آماده همکاری به صورت دورکاری یا پروژه‌ای هستم و تجربه خوبی در انجام پروژه‌های تیمی دارم. همچنین، به یادگیری مداوم و رشد فردی اهمیت می‌دهم و در کنار توسعه مهارت‌های فنی، روی تقویت مهارت‌های تجاری نیز تمرکز دارم.",
  
  "karjooDescription": "در این پروژه، با همکاری تیمی و با استفاده از ابزارهایی مانند تیلویند سی‌اس‌اس، جاوااسکریپت، فیگما، ترلو، گوگل میت و گیت‌هاب، رابط کاربری طراحی‌شده برای استودیو منابع انسانی کارجوپلاس را به طور کامل پیاده‌سازی کردم. نتیجه این همکاری، یک لندینگ حرفه‌ای و واکنش‌گرا برای معرفی خدمات و محصولات کارجوپلاس شد که نقش مهمی در جذب کارفرمایان و کارجویان دارد.",
  "nextCoffeeDescription": "در پروژه next-coffee، با استفاده از فریم‌ورک نکست‌جی‌اس و ابزار تیلویند سی‌اس‌اس، یک وب‌اپلیکیشن مدرن برای سفارش آنلاین قهوه پیاده‌سازی کرده‌ام. در این پروژه، قابلیت ثبت‌نام کاربر با استفاده از ابزار serverjson فراهم شده و کاربران می‌توانند پس از عضویت، سفارش خود را به صورت آنلاین ثبت کنند. تمامی بخش‌های رابط کاربری با بهره‌گیری از تیلویند سی‌اس‌اس طراحی و پیاده‌سازی شده است تا تجربه کاربری ساده و واکنش‌گرا ارائه شود.",
  "dashboardDescription": "در پروژه داشبورد با استفاده از ReactJS و ابزارهایی مانند Formik، Polaris Shopify، Yap، Apollo Client و GraphQL، بخش فرانت‌اند یک پلتفرم مدیریت شغل را پیاده‌سازی کردم. کاربران پس از ثبت‌نام و ورود، می‌توانند به عنوان کارفرما شغل ایجاد، ویرایش یا حذف کنند و لیست موقعیت‌های شغلی خود را در صفحه اختصاصی مشاهده نمایند. بک‌اند این پروژه توسط توسعه‌دهنده دیگر آماده شده است.",
  "zamalaserDescription": "در پروژه زامالیزر، طراحی کامل سایت با استفاده از وردپرس و صفحه‌ساز Elementor انجام شده است. قالب اولیه Astra و افزونه Bookly برای پیاده‌سازی سیستم نوبت‌دهی آنلاین کلینیک لیزر بدن زاما استفاده شده و تمامی تصاویر و بنرهای سایت توسط خودم طراحی و بارگذاری شده‌اند. این سایت مجهز به درگاه پرداخت آنلاین، پنل پیامکی و روی هاست اختصاصی دپلوی شده و شامل یک سال پشتیبانی پس از راه‌اندازی است.",
  "View project": "مشاهده پروژه"


}
